Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier Class Reference
MEP Element Manager
Modifier of the CableCarrierSegmentPreferenceTable. More...
#include <MEPCableCarrierSegmentPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier:
 Public Member Functions
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< uint32_t >  | AddNewPreference ()
Inserts a new empty line in the table.
Result< void >  | Delete (uint32_t index)
Deletes a row from the table.
Result< uint32_t >  | SetValue (uint32_t index, double value)
Sets the value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
void  | SetUseIndividualSegmentLengths (bool value)
Sets the use of individual segment lengths. If this is false, there will be only one rigid segment for each routing segment, and the minimum and maximum segmentation lengths are ignored when generating routings.
Result< void >  | SetSegmentationLengths (double minimum, double maximum)
Sets the segmentation lengths of the rigid segment. If the segmentation is turned off, the value is ignored when generating routings, and the rigid segment will be the same length as the routing segment.
 Protected Member Functions
Modifier (CableCarrierSegmentPreferenceTable &parent)
Constructs a Modifier with the CableCarrierSegmentPreferenceTable.
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the CableCarrierSegmentPreferenceTable.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier::Modifier  |  ( |  CableCarrierSegmentPreferenceTable & |  parent | )
protected
Constructs a Modifier with the CableCarrierSegmentPreferenceTable.
Parameters
parent | The given CableCarrierSegmentPreferenceTable.
Member Function Documentation
◆ AddNewPreference()
 Result< uint32_t > ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier::AddNewPreference  |  ( |   | )
Inserts a new empty line in the table.
Returns
Returns error if there is already an unset row in the CableCarrierSegmentPreferenceTable, otherwise returns the index of the newly inserted row. Do not forget to set a value to it afterwards, otherwise it will be automatically deleted at the end of the Modify scope.
◆ Delete()
 Result< void > ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier::Delete  |  ( |  uint32_t |  index | )
Deletes a row from the table.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier::SetDescription  |  ( |  uint32_t |  index,
|  const GS::UniString & |  description )
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier::SetName  |  ( |  const GS::UniString & |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.
◆ SetSegmentationLengths()
 Result< void > ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier::SetSegmentationLengths  |  ( |  double |  minimum,
|  double |  maximum )
Sets the segmentation lengths of the rigid segment. If the segmentation is turned off, the value is ignored when generating routings, and the rigid segment will be the same length as the routing segment.
Parameters
minimum | The minimum segmentation length of the rigid segment.
maximum | The maximum segmentation length of the rigid segment.
Returns
Returns error if any of the parameters are negative, or if the condition minimum * 2 <= maximum is false, otherwise nothing.
◆ SetUseIndividualSegmentLengths()
 void ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier::SetUseIndividualSegmentLengths  |  ( |  bool |  value | )
Sets the use of individual segment lengths. If this is false, there will be only one rigid segment for each routing segment, and the minimum and maximum segmentation lengths are ignored when generating routings.
Parameters
value | The value to be set.
◆ SetValue()
 Result< uint32_t > ACAPI::MEP::CableCarrierSegmentPreferenceTable::Modifier::SetValue  |  ( |  uint32_t |  index,
|  double |  value )
Sets the value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
value | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range or if the new value would be a duplicate, otherwise returns the new index of the modified row.